ubparot/AQUAScan/Firmware/ESP32/AQUAScanESP32/AQUAScanESP32.ino
/*
  AQUAScan ESP32 boat gateway.

  Target board: ESP32 DevKit-style board
  USB Serial: 19200 debug monitor
  WebSocket: ws://<esp32-ip>:81/
  Direct ESC PWM output: GPIO18 left, GPIO19 right
  Optional Serial2 bridge: 19200 link to the Arduino Mega ESC bridge

  WebSocket control messages accepted from the web app and Unity:
    {"type":"hello","client":"AQUAScan Web","version":"0.1.0"}
    {"type":"drive","seq":42,"armed":true,"estop":false,"x":0.2,"y":0.8,"left":1850,"right":1650}
    {"type":"estop","seq":43}

  Status message returned to the operator UI:
    {"type":"status","connected":true,"armed":false,"estop":false,"lastSeq":43,"left":1500,"right":1500,"rssi":-42}
*/

#include <WiFi.h>
#include <WebSocketsServer.h>
#include <ctype.h>
#include <math.h>

#if __has_include(<esp_arduino_version.h>)
  #include <esp_arduino_version.h>
#endif

#ifndef ESP_ARDUINO_VERSION_MAJOR
  #define ESP_ARDUINO_VERSION_MAJOR 2
#endif

#if __has_include(<TinyGPSPlus.h>)
  #include <TinyGPSPlus.h>
  #define AQUASCAN_HAS_TINYGPS 1
#else
  #define AQUASCAN_HAS_TINYGPS 0
#endif

namespace
{
  // Edit these before flashing if you want router/STATION mode.
  const char* kStaSsid = "SETUP-C4AF";
  const char* kStaPassword = "county5845drain";
  const unsigned long kStaConnectTimeoutMs = 15000;

  // Fallback access point. Connect the laptop/tablet to this SSID if router join fails.
  const char* kApSsid = "Aquascan";
  const char* kApPassword = "idkbro";

  const uint16_t kWebSocketPort = 81;
  const unsigned long kCommandTimeoutMs = 15000;
  const unsigned long kBridgeKeepaliveIntervalMs = 100;
  const unsigned long kStatusBroadcastIntervalMs = 250;
  const unsigned long kBatterySampleIntervalMs = 1000;
  const unsigned long kGpsFreshMs = 3000;
  const unsigned long kSensorFreshMs = 3000;

  const long kDebugBaudRate = 19200;
  const long kBridgeBaudRate = 19200;
  const int kBridgeRxPin = 16;
  const int kBridgeTxPin = 17;
  const bool kUseArduinoBridge = true;

  // Direct ESC PWM output. Use output-capable pins that are not RX0/TX0.
  const bool kUseDirectEscOutputs = false;
  const int kLeftEscPin = 18;
  const int kRightEscPin = 19;
  const int kLeftEscChannel = 0;
  const int kRightEscChannel = 1;
  const int kEscPwmHz = 50;
  const int kEscPwmResolutionBits = 16;
  const uint32_t kEscPwmPeriodUs = 20000;
  const uint32_t kEscPwmMaxDuty = (1UL << kEscPwmResolutionBits) - 1;

  // Optional boat GPS. Install TinyGPSPlus to enable parsing; otherwise it compiles out.
  const long kGpsBaudRate = 9600;
  const int kGpsRxPin = 25;
  const int kGpsTxPin = 26;

  // Optional battery telemetry. Leave disabled until the voltage divider is wired and calibrated.
  const int kBatterySensePin = -1; // Example: 35
  const float kAdcReferenceVoltage = 3.3f;
  const float kAdcMaxValue = 4095.0f;
  const float kBatteryDividerScale = 1.0f;
  const float kBatteryEmptyVoltage = 10.5f;
  const float kBatteryFullVoltage = 12.6f;

  const int kNeutralMicros = 1500;
  const int kMinMicros = 1000;
  const int kMaxMicros = 2000;
  const size_t kMaxBridgeCommandLength = 64;
  const size_t kMaxBridgeLineLength = 256;
  const uint8_t kTrackedSocketSlots = 8;
}

HardwareSerial BridgeSerial(2);
WebSocketsServer webSocket(kWebSocketPort);

#if AQUASCAN_HAS_TINYGPS
HardwareSerial GpsSerial(1);
TinyGPSPlus gps;
#endif

char bridgeLine[kMaxBridgeLineLength];
size_t bridgeLineLength = 0;
String usbCommandLine;

bool socketSlots[kTrackedSocketSlots] = { false };
uint8_t connectedClientCount = 0;

bool armed = false;
bool estop = false;
int lastSeq = 0;
int leftMicros = kNeutralMicros;
int rightMicros = kNeutralMicros;
bool bridgeArmed = false;
bool bridgeEstop = false;
int bridgeLastSeq = 0;
int bridgeLeftMicros = kNeutralMicros;
int bridgeRightMicros = kNeutralMicros;
int probeDirection = 0;
int probeSpeed = 0;
int bridgeProbeDirection = 0;
int bridgeProbeSpeed = 0;
unsigned long lastCommandAt = 0;
unsigned long lastBridgeCommandAt = 0;
unsigned long lastDriveLogAt = 0;
unsigned long lastProbeCommandAt = 0;
unsigned long lastProbeBridgeCommandAt = 0;
unsigned long lastStatusBroadcastAt = 0;
unsigned long lastBatterySampleAt = 0;

bool gpsFix = false;
double latitude = 0.0;
double longitude = 0.0;
double altitudeMeters = 0.0;
double headingDeg = 0.0;
double speedMps = 0.0;
unsigned long lastGpsFixAt = 0;

float batteryVoltage = NAN;
float batteryPercent = NAN;

bool sensorReceived = false;
unsigned long lastSensorAt = 0;
int sensorSeq = 0;
float sensorTemperatureC = NAN;
int sensorTempRawGpio = 0;
int sensorTurbidityRaw = 0;
float sensorTurbidityVoltage = NAN;
int sensorPhRaw = 0;
float sensorPhVoltage = NAN;
float sensorDistanceCm = NAN;
int sensorDissolvedOxygenRaw = 0;
float sensorDissolvedOxygenVoltage = NAN;
int sensorTdsRaw = 0;
float sensorTdsVoltage = NAN;
int sensorUvRaw = 0;
float sensorUvVoltage = NAN;
int sensorLightRaw = 0;
float sensorLightVoltage = NAN;

bool missionUploadActive = false;
String uploadMissionId;
String uploadChecksum;
int uploadWaypointCount = 0;
int uploadReceivedWaypoints = 0;

void startNetwork();
bool connectToRouter();
void startFallbackAccessPoint();
void handleSocketEvent(uint8_t clientNum, WStype_t type, uint8_t* payload, size_t length);
void handleTextMessage(uint8_t clientNum, const char* payload, size_t length);
void handleDriveMessage(uint8_t clientNum, const String& message);
void handleEstopMessage(uint8_t clientNum, const String& message);
void handleProbeControlMessage(uint8_t clientNum, const String& message);
void handleMissionUploadMessage(uint8_t clientNum, const String& type, const String& message);
void readUsbSerialCommands();
void handleUsbSerialCommand(String command);
void printUsbHelp();
void applyManualEscCommand(int left, int right);
void setupEscOutputs();
void applyEscOutputs(int left, int right);
void writeEscPulse(int pin, int channel, int micros);
void readBridgeStatus();
void applyBridgeStatus(const char* line);
void applyBridgeProbeStatus(const char* line);
void applyBridgeSensorStatus(const char* line);
bool writeBridgeLine(const char* line);
void sendBridgeCommand();
void sendBridgeProbeCommand();
void stopProbe(const char* reason);
void neutralize(const char* reason);
void updateTelemetry();
void updateGps();
void updateBattery();
void sendStatus(uint8_t clientNum);
void sendStatusBroadcast();
void sendSensorBroadcast();
String buildStatusJson();
String buildSensorJson();
void sendMissionAck(uint8_t clientNum, const String& missionId, int seq, bool accepted, const String& text);
void sendMissionProgress(uint8_t clientNum);
bool hasSocketClient();
void markSocketConnected(uint8_t clientNum);
void markSocketDisconnected(uint8_t clientNum);
bool parseCsvIntegers(const char* line, int* values, int expectedCount);
bool parseCsvFloats(const char* line, float* values, int expectedCount);
int clampPulse(int value);
String socketPayloadToString(const char* payload, size_t length);
String readJsonString(const String& message, const char* key, const String& fallback);
bool readJsonBool(const String& message, const char* key, bool fallback);
int readJsonInt(const String& message, const char* key, int fallback);
float readJsonFloat(const String& message, const char* key, float fallback);
int findJsonValueStart(const String& message, const char* key);
String escapeJson(const String& value);
void appendSensorJsonFields(String& message);
void appendJsonNumber(String& json, const char* key, double value, int decimals);

void setup()
{
  Serial.begin(kDebugBaudRate);
  delay(1500);
  Serial.println();
  Serial.println(F("BOOT: AQUAScan ESP32 boat gateway starting setup."));
  Serial.flush();

  setupEscOutputs();

  if (kUseArduinoBridge)
  {
    BridgeSerial.begin(kBridgeBaudRate, SERIAL_8N1, kBridgeRxPin, kBridgeTxPin);
    Serial.print(F("BOOT: Bridge UART started at "));
    Serial.print(kBridgeBaudRate);
    Serial.print(F(" 8N1, RX GPIO"));
    Serial.print(kBridgeRxPin);
    Serial.print(F(", TX GPIO"));
    Serial.println(kBridgeTxPin);
  }
  else
  {
    Serial.println(F("BOOT: Arduino bridge disabled; using direct ESC outputs."));
  }
  Serial.flush();

#if AQUASCAN_HAS_TINYGPS
  GpsSerial.begin(kGpsBaudRate, SERIAL_8N1, kGpsRxPin, kGpsTxPin);
  Serial.println(F("GPS telemetry: TinyGPSPlus enabled."));
#else
  Serial.println(F("GPS telemetry: TinyGPSPlus not installed; GPS fields are disabled."));
#endif

  if (kBatterySensePin >= 0)
  {
    analogReadResolution(12);
    analogSetPinAttenuation(kBatterySensePin, ADC_11db);
    Serial.println(F("Battery telemetry: enabled."));
  }
  else
  {
    Serial.println(F("Battery telemetry: disabled. Set kBatterySensePin after wiring a divider."));
  }

  startNetwork();
  Serial.println(F("BOOT: Network setup complete."));
  Serial.flush();

  webSocket.begin();
  webSocket.onEvent(handleSocketEvent);
  Serial.println(F("BOOT: WebSocket server started."));
  Serial.flush();

  neutralize("boot");
  Serial.println(F("AQUAScan ESP32 bridge ready."));
  Serial.flush();
}

void loop()
{
  const unsigned long now = millis();

  webSocket.loop();
  readUsbSerialCommands();
  if (kUseArduinoBridge)
    readBridgeStatus();
  updateTelemetry();

  if (hasSocketClient() && now - lastStatusBroadcastAt >= kStatusBroadcastIntervalMs)
  {
    sendStatusBroadcast();
    lastStatusBroadcastAt = now;
  }

