ubparot/AQUAScan/Firmware/ESP32/AQUAScanESP32/AQUAScanESP32.ino
  if (kUseArduinoBridge && hasSocketClient() && lastCommandAt > 0 && now - lastBridgeCommandAt >= kBridgeKeepaliveIntervalMs)
    sendBridgeCommand();

  if (kUseArduinoBridge && probeDirection != 0 && now - lastProbeBridgeCommandAt >= kBridgeKeepaliveIntervalMs)
    sendBridgeProbeCommand();

  if (armed && lastCommandAt > 0 && now - lastCommandAt > kCommandTimeoutMs)
    neutralize("command timeout");

  if (lastProbeCommandAt > 0 && now - lastProbeCommandAt > kCommandTimeoutMs)
    stopProbe("probe command timeout");
}

void handleSocketEvent(uint8_t clientNum, WStype_t type, uint8_t* payload, size_t length)
{
  switch (type)
  {
    case WStype_CONNECTED:
      markSocketConnected(clientNum);
      Serial.printf("WebSocket client connected: #%u\n", clientNum);
      sendStatus(clientNum);
      break;

    case WStype_DISCONNECTED:
      markSocketDisconnected(clientNum);
      Serial.printf("WebSocket client disconnected: #%u\n", clientNum);
      if (!hasSocketClient())
        neutralize("all clients disconnected");
      break;

    case WStype_TEXT:
      handleTextMessage(clientNum, reinterpret_cast<const char*>(payload), length);
      break;

    default:
      break;
  }
}

void handleTextMessage(uint8_t clientNum, const char* payload, size_t length)
{
  String message = socketPayloadToString(payload, length);
  message.trim();

  const String type = readJsonString(message, "type", "");

  if (type == "hello")
  {
    sendStatus(clientNum);
    return;
  }

  if (type == "drive")
  {
    handleDriveMessage(clientNum, message);
    return;
  }

  if (type == "estop")
  {
    handleEstopMessage(clientNum, message);
    return;
  }

  if (type == "probe_control")
  {
    handleProbeControlMessage(clientNum, message);
    return;
  }

  if (type == "mission_upload_begin" || type == "mission_waypoint" || type == "mission_upload_commit" || type == "mission_upload_abort")
  {
    handleMissionUploadMessage(clientNum, type, message);
    return;
  }

  Serial.printf("Ignoring unknown WebSocket message type '%s'.\n", type.c_str());
  neutralize("unknown message");
  sendStatus(clientNum);
}

void handleDriveMessage(uint8_t clientNum, const String& message)
{
  const int nextSeq = readJsonInt(message, "seq", lastSeq);
  const bool nextArmed = readJsonBool(message, "armed", false);
  const bool nextEstop = readJsonBool(message, "estop", false);
  const int nextLeft = readJsonInt(message, "left", kNeutralMicros);
  const int nextRight = readJsonInt(message, "right", kNeutralMicros);

  if (nextLeft < kMinMicros || nextLeft > kMaxMicros || nextRight < kMinMicros || nextRight > kMaxMicros)
  {
    neutralize("pulse out of range");
    sendStatus(clientNum);
    return;
  }

  lastSeq = nextSeq;
  estop = nextEstop;
  armed = nextArmed && !estop;
  leftMicros = armed ? nextLeft : kNeutralMicros;
  rightMicros = armed ? nextRight : kNeutralMicros;
  lastCommandAt = millis();

  applyEscOutputs(leftMicros, rightMicros);

  const unsigned long now = millis();
  if (now - lastDriveLogAt >= 1000)
  {
    lastDriveLogAt = now;
    Serial.printf("Drive seq=%d armed=%d estop=%d left=%d right=%d\n", lastSeq, armed ? 1 : 0, estop ? 1 : 0, leftMicros, rightMicros);
  }
}

void handleEstopMessage(uint8_t clientNum, const String& message)
{
  lastSeq = readJsonInt(message, "seq", lastSeq);
  estop = true;
  armed = false;
  leftMicros = kNeutralMicros;
  rightMicros = kNeutralMicros;
  lastCommandAt = millis();

  applyEscOutputs(leftMicros, rightMicros);
  sendBridgeCommand();
  sendStatus(clientNum);
  Serial.printf("E-stop latched seq=%d\n", lastSeq);
}

void handleProbeControlMessage(uint8_t clientNum, const String& message)
{
  lastSeq = readJsonInt(message, "seq", lastSeq);
  const String direction = readJsonString(message, "direction", "stop");
  const int speed = constrain(readJsonInt(message, "speed", 0), 0, 255);

  if (estop)
  {
    probeDirection = 0;
    probeSpeed = 0;
  }
  else if (direction == "lower")
  {
    probeDirection = 1;
    probeSpeed = speed;
  }
  else if (direction == "raise")
  {
    probeDirection = -1;
    probeSpeed = speed;
  }
  else
  {
    probeDirection = 0;
    probeSpeed = 0;
  }

  lastProbeCommandAt = probeDirection == 0 ? 0 : millis();
  sendBridgeProbeCommand();
  sendStatus(clientNum);

  Serial.printf("Probe seq=%d direction=%d speed=%d\n", lastSeq, probeDirection, probeSpeed);
}

void handleMissionUploadMessage(uint8_t clientNum, const String& type, const String& message)
{
  const int seq = readJsonInt(message, "seq", lastSeq);
  const String missionId = readJsonString(message, "missionId", uploadMissionId);

  if (type == "mission_upload_begin")
  {
    missionUploadActive = true;
    uploadMissionId = missionId;
    uploadChecksum = readJsonString(message, "checksum", "");
    uploadWaypointCount = max(0, readJsonInt(message, "waypointCount", 0));
    uploadReceivedWaypoints = 0;
    lastSeq = seq;

    sendMissionAck(clientNum, uploadMissionId, seq, uploadWaypointCount > 0, uploadWaypointCount > 0 ? "upload_started" : "empty_mission");
    sendMissionProgress(clientNum);
    return;
  }

  if (type == "mission_waypoint")
  {
    const int index = readJsonInt(message, "index", -1);
    const bool accepted = missionUploadActive && missionId == uploadMissionId && index >= 0 && index < uploadWaypointCount;
    if (accepted)
      uploadReceivedWaypoints = max(uploadReceivedWaypoints, index + 1);
    lastSeq = seq;

    sendMissionAck(clientNum, missionId, seq, accepted, accepted ? "waypoint_received" : "waypoint_rejected");
    sendMissionProgress(clientNum);
    return;
  }

  if (type == "mission_upload_commit")
  {
    const String checksum = readJsonString(message, "checksum", "");
    const bool accepted = missionUploadActive && missionId == uploadMissionId && checksum == uploadChecksum && uploadReceivedWaypoints == uploadWaypointCount;
    lastSeq = seq;

    sendMissionAck(clientNum, missionId, seq, accepted, accepted ? "upload_committed" : "upload_incomplete");
    sendMissionProgress(clientNum);
    if (accepted)
      missionUploadActive = false;
    return;
  }

  if (type == "mission_upload_abort")
  {
    missionUploadActive = false;
    uploadMissionId = missionId;
    uploadReceivedWaypoints = 0;
    uploadWaypointCount = 0;
    lastSeq = seq;

    sendMissionAck(clientNum, missionId, seq, true, "upload_aborted");
  }
}

void readUsbSerialCommands()
{
  while (Serial.available() > 0)
  {
    const char incoming = static_cast<char>(Serial.read());
    if (incoming == '\n' || incoming == '\r')
    {
      usbCommandLine.trim();
      if (usbCommandLine.length() > 0)
        handleUsbSerialCommand(usbCommandLine);
      usbCommandLine = "";
      continue;
    }

