ubparot/AQUAScan/Firmware/ESP32/AQUAScanESP32/AQUAScanESP32.ino
    if (usbCommandLine.length() < 96)
      usbCommandLine += incoming;
    else
      usbCommandLine = "";
  }
}

void handleUsbSerialCommand(String command)
{
  command.trim();
  command.toLowerCase();

  if (command == "help" || command == "?")
  {
    printUsbHelp();
    return;
  }

  if (command == "status")
  {
    Serial.println(buildStatusJson());
    return;
  }

  if (command == "arm")
  {
    estop = false;
    armed = true;
    leftMicros = kNeutralMicros;
    rightMicros = kNeutralMicros;
    lastSeq++;
    lastCommandAt = millis();
    applyEscOutputs(leftMicros, rightMicros);
    sendBridgeCommand();
    Serial.println(F("USB: armed at neutral."));
    return;
  }

  if (command == "disarm" || command == "stop" || command == "neutral")
  {
    armed = false;
    estop = false;
    leftMicros = kNeutralMicros;
    rightMicros = kNeutralMicros;
    lastSeq++;
    lastCommandAt = 0;
    applyEscOutputs(leftMicros, rightMicros);
    sendBridgeCommand();
    Serial.println(F("USB: neutral/disarmed."));
    return;
  }

  if (command == "estop")
  {
    armed = false;
    estop = true;
    leftMicros = kNeutralMicros;
    rightMicros = kNeutralMicros;
    lastSeq++;
    lastCommandAt = 0;
    applyEscOutputs(leftMicros, rightMicros);
    sendBridgeCommand();
    Serial.println(F("USB: e-stop latched."));
    return;
  }

  if (command == "clear")
  {
    armed = false;
    estop = false;
    leftMicros = kNeutralMicros;
    rightMicros = kNeutralMicros;
    lastSeq++;
    applyEscOutputs(leftMicros, rightMicros);
    sendBridgeCommand();
    Serial.println(F("USB: e-stop cleared; neutral/disarmed."));
    return;
  }

  if (command.startsWith("esc "))
  {
    const int separator = command.indexOf(' ', 4);
    if (separator < 0)
    {
      Serial.println(F("USB: expected 'esc <leftMicros> <rightMicros>'."));
      return;
    }

    const int nextLeft = command.substring(4, separator).toInt();
    const int nextRight = command.substring(separator + 1).toInt();
    applyManualEscCommand(nextLeft, nextRight);
    return;
  }

  if (command.startsWith("both "))
  {
    const int pulse = command.substring(5).toInt();
    applyManualEscCommand(pulse, pulse);
    return;
  }

  Serial.println(F("USB: unknown command. Type 'help'."));
}

void printUsbHelp()
{
  Serial.println(F("USB commands:"));
  Serial.println(F("  help              show this help"));
  Serial.println(F("  status            print current status JSON"));
  Serial.println(F("  arm               arm at neutral"));
  Serial.println(F("  disarm            neutral and disarm"));
  Serial.println(F("  stop              neutral and disarm"));
  Serial.println(F("  estop             latch e-stop at neutral"));
  Serial.println(F("  clear             clear e-stop and disarm"));
  Serial.println(F("  both 1500         set both ESC pulses; requires arm"));
  Serial.println(F("  esc 1500 1500     set left/right pulses; requires arm"));
  Serial.println(F("Pulse range is 1000-2000 us. Start with props removed."));
}

void applyManualEscCommand(int left, int right)
{
  if (estop)
  {
    Serial.println(F("USB: e-stop is latched. Type 'clear' first."));
    return;
  }

  if (!armed)
  {
    Serial.println(F("USB: not armed. Type 'arm' first."));
    return;
  }

  if (left < kMinMicros || left > kMaxMicros || right < kMinMicros || right > kMaxMicros)
  {
    Serial.println(F("USB: pulse out of range. Use 1000-2000."));
    return;
  }

  lastSeq++;
  leftMicros = left;
  rightMicros = right;
  lastCommandAt = millis();
  applyEscOutputs(leftMicros, rightMicros);
  sendBridgeCommand();

  Serial.print(F("USB: applied left="));
  Serial.print(leftMicros);
  Serial.print(F(" right="));
  Serial.println(rightMicros);
}

void setupEscOutputs()
{
  if (!kUseDirectEscOutputs)
  {
    Serial.println(F("BOOT: Direct ESC outputs disabled."));
    return;
  }

#if ESP_ARDUINO_VERSION_MAJOR >= 3
  ledcAttach(kLeftEscPin, kEscPwmHz, kEscPwmResolutionBits);
  ledcAttach(kRightEscPin, kEscPwmHz, kEscPwmResolutionBits);
#else
  ledcSetup(kLeftEscChannel, kEscPwmHz, kEscPwmResolutionBits);
  ledcSetup(kRightEscChannel, kEscPwmHz, kEscPwmResolutionBits);
  ledcAttachPin(kLeftEscPin, kLeftEscChannel);
  ledcAttachPin(kRightEscPin, kRightEscChannel);
#endif

  applyEscOutputs(kNeutralMicros, kNeutralMicros);
  Serial.print(F("BOOT: Direct ESC outputs on GPIO "));
  Serial.print(kLeftEscPin);
  Serial.print(F(" and GPIO "));
  Serial.print(kRightEscPin);
  Serial.println(F("."));
}

void applyEscOutputs(int left, int right)
{
  if (!kUseDirectEscOutputs)
    return;

  writeEscPulse(kLeftEscPin, kLeftEscChannel, left);
  writeEscPulse(kRightEscPin, kRightEscChannel, right);
}

void writeEscPulse(int pin, int channel, int micros)
{
  const int clampedMicros = clampPulse(micros);
  const uint32_t duty = (static_cast<uint32_t>(clampedMicros) * kEscPwmMaxDuty + (kEscPwmPeriodUs / 2)) / kEscPwmPeriodUs;

#if ESP_ARDUINO_VERSION_MAJOR >= 3
  ledcWrite(pin, duty);
#else
  ledcWrite(channel, duty);
#endif
}

void readBridgeStatus()
{
  while (BridgeSerial.available() > 0)
  {
    const char incoming = static_cast<char>(BridgeSerial.read());

    if (incoming == '\n' || incoming == '\r')
    {
      if (bridgeLineLength > 0)
      {
        bridgeLine[bridgeLineLength] = '\0';
        if (bridgeLine[0] == 'S')
          applyBridgeStatus(bridgeLine);
        else if (bridgeLine[0] == 'P')
          applyBridgeProbeStatus(bridgeLine);
        else if (bridgeLine[0] == 'R')
          applyBridgeSensorStatus(bridgeLine);
        bridgeLineLength = 0;
      }
      continue;
    }

    if (bridgeLineLength < kMaxBridgeLineLength - 1)
    {
      bridgeLine[bridgeLineLength++] = incoming;
    }
    else
    {
      bridgeLineLength = 0;
      neutralize("bridge line too long");
    }
  }
}

void applyBridgeStatus(const char* line)
{
  int values[5] = { bridgeLastSeq, bridgeArmed ? 1 : 0, bridgeEstop ? 1 : 0, bridgeLeftMicros, bridgeRightMicros };
  if (!parseCsvIntegers(line, values, 5))
    return;

  bridgeLastSeq = values[0];
  bridgeArmed = values[1] != 0;
  bridgeEstop = values[2] != 0;
  bridgeLeftMicros = clampPulse(values[3]);
  bridgeRightMicros = clampPulse(values[4]);
}

void applyBridgeProbeStatus(const char* line)
{
  int values[3] = { bridgeLastSeq, bridgeProbeDirection, bridgeProbeSpeed };
  if (!parseCsvIntegers(line, values, 3))
    return;

  bridgeLastSeq = values[0];
  bridgeProbeDirection = constrain(values[1], -1, 1);
  bridgeProbeSpeed = constrain(values[2], 0, 255);
}

void applyBridgeSensorStatus(const char* line)
{
  if (line[0] != 'R' || line[1] != ',')
    return;

  const char* payload = line + 2;
  if (payload[0] == 'P' && payload[1] == ',')
    payload += 2;

  float values[16] = {};
  if (!parseCsvFloats(payload, values, 16))
  {
    Serial.print(F("Ignored malformed sensor line: "));
    Serial.println(line);
    return;
  }

  sensorReceived = true;
  lastSensorAt = millis();
  sensorSeq = static_cast<int>(values[0]);
  sensorTemperatureC = values[1];
  sensorTempRawGpio = static_cast<int>(values[2]);
  sensorTurbidityRaw = static_cast<int>(values[3]);
  sensorTurbidityVoltage = values[4];
  sensorPhRaw = static_cast<int>(values[5]);
  sensorPhVoltage = values[6];
  sensorDistanceCm = values[7];
  sensorDissolvedOxygenRaw = static_cast<int>(values[8]);
  sensorDissolvedOxygenVoltage = values[9];
  sensorTdsRaw = static_cast<int>(values[10]);
  sensorTdsVoltage = values[11];
  sensorUvRaw = static_cast<int>(values[12]);
  sensorUvVoltage = values[13];
  sensorLightRaw = static_cast<int>(values[14]);
  sensorLightVoltage = values[15];

  Serial.print(F("Sensor packet seq="));
  Serial.println(sensorSeq);

