ubparot/AQUAScan/Firmware/ESP32/AQUAScanESP32/AQUAScanESP32.ino
  if (hasSocketClient())
    sendSensorBroadcast();
}

void sendBridgeCommand()
{
  if (!kUseArduinoBridge)
    return;

  char line[kMaxBridgeCommandLength];
  const int length = snprintf(
    line,
    sizeof(line),
    "D,%d,%d,%d,%d,%d\n",
    lastSeq,
    armed ? 1 : 0,
    estop ? 1 : 0,
    leftMicros,
    rightMicros);

  if (length > 0 && static_cast<size_t>(length) < sizeof(line) && writeBridgeLine(line))
    lastBridgeCommandAt = millis();
}

void sendBridgeProbeCommand()
{
  if (!kUseArduinoBridge)
    return;

  char line[kMaxBridgeCommandLength];
  const int length = snprintf(
    line,
    sizeof(line),
    "W,%d,%d,%d\n",
    lastSeq,
    probeDirection,
    probeSpeed);

  if (length > 0 && static_cast<size_t>(length) < sizeof(line) && writeBridgeLine(line))
    lastProbeBridgeCommandAt = millis();
}

bool writeBridgeLine(const char* line)
{
  const size_t length = strlen(line);
  const size_t written = BridgeSerial.write(
    reinterpret_cast<const uint8_t*>(line),
    length);
  BridgeSerial.flush();

  if (written == length)
    return true;

  Serial.print(F("Bridge UART short write. Expected="));
  Serial.print(length);
  Serial.print(F(" wrote="));
  Serial.println(written);
  return false;
}

void stopProbe(const char* reason)
{
  probeDirection = 0;
  probeSpeed = 0;
  lastProbeCommandAt = 0;
  sendBridgeProbeCommand();
  if (hasSocketClient())
    sendStatusBroadcast();

  Serial.printf("Probe stopped: %s\n", reason);
}

void neutralize(const char* reason)
{
  armed = false;
  leftMicros = kNeutralMicros;
  rightMicros = kNeutralMicros;
  probeDirection = 0;
  probeSpeed = 0;
  lastCommandAt = 0;
  lastProbeCommandAt = 0;

  applyEscOutputs(leftMicros, rightMicros);
  sendBridgeCommand();
  sendBridgeProbeCommand();
  if (hasSocketClient())
    sendStatusBroadcast();

  Serial.printf("Neutralized: %s\n", reason);
}

void updateTelemetry()
{
  updateGps();
  updateBattery();
}

void updateGps()
{
#if AQUASCAN_HAS_TINYGPS
  while (GpsSerial.available() > 0)
    gps.encode(static_cast<char>(GpsSerial.read()));

  if (gps.location.isValid() && gps.location.isUpdated())
  {
    gpsFix = true;
    latitude = gps.location.lat();
    longitude = gps.location.lng();
    lastGpsFixAt = millis();
  }

  if (gps.altitude.isValid())
    altitudeMeters = gps.altitude.meters();
  if (gps.course.isValid())
    headingDeg = gps.course.deg();
  if (gps.speed.isValid())
    speedMps = gps.speed.mps();

  if (gpsFix && millis() - lastGpsFixAt > kGpsFreshMs)
    gpsFix = false;
#endif
}

void updateBattery()
{
  if (kBatterySensePin < 0)
    return;

  const unsigned long now = millis();
  if (now - lastBatterySampleAt < kBatterySampleIntervalMs)
    return;

  lastBatterySampleAt = now;
  const int raw = analogRead(kBatterySensePin);
  const float sensedVoltage = (static_cast<float>(raw) / kAdcMaxValue) * kAdcReferenceVoltage;
  batteryVoltage = sensedVoltage * kBatteryDividerScale;
  batteryPercent = constrain(((batteryVoltage - kBatteryEmptyVoltage) / (kBatteryFullVoltage - kBatteryEmptyVoltage)) * 100.0f, 0.0f, 100.0f);
}

void sendStatus(uint8_t clientNum)
{
  String message = buildStatusJson();
  webSocket.sendTXT(clientNum, message);
}

void sendStatusBroadcast()
{
  String message = buildStatusJson();
  webSocket.broadcastTXT(message);
}

void sendSensorBroadcast()
{
  String message = buildSensorJson();
  webSocket.broadcastTXT(message);
}

String buildStatusJson()
{
  String message;
  message.reserve(640);
  message += F("{\"type\":\"status\"");
  message += F(",\"connected\":");
  message += (hasSocketClient() ? F("true") : F("false"));
  message += F(",\"armed\":");
  message += (armed ? F("true") : F("false"));
  message += F(",\"estop\":");
  message += (estop ? F("true") : F("false"));
  message += F(",\"lastSeq\":");
  message += lastSeq;
  message += F(",\"left\":");
  message += leftMicros;
  message += F(",\"right\":");
  message += rightMicros;
  message += F(",\"probeDirection\":\"");
  message += probeDirection > 0 ? F("lower") : probeDirection < 0 ? F("raise") : F("stop");
  message += F("\",\"probeSpeed\":");
  message += probeSpeed;
  message += F(",\"rssi\":");
  message += (WiFi.status() == WL_CONNECTED ? WiFi.RSSI() : -1);

  if (gpsFix)
  {
    appendJsonNumber(message, "latitude", latitude, 7);
    appendJsonNumber(message, "longitude", longitude, 7);
    appendJsonNumber(message, "altitude", altitudeMeters, 2);
    appendJsonNumber(message, "headingDeg", headingDeg, 1);
    appendJsonNumber(message, "speedMps", speedMps, 2);
  }

  if (!isnan(batteryPercent))
  {
    appendJsonNumber(message, "batteryPercent", batteryPercent, 1);
    appendJsonNumber(message, "batteryVoltage", batteryVoltage, 2);
  }

  if (sensorReceived)
    appendSensorJsonFields(message);

  message += '}';
  return message;
}

String buildSensorJson()
{
  String message;
  message.reserve(360);
  message += F("{\"type\":\"sensor\"");
  message += F(",\"connected\":");
  message += (hasSocketClient() ? F("true") : F("false"));
  appendSensorJsonFields(message);
  message += '}';
  return message;
}

void sendMissionAck(uint8_t clientNum, const String& missionId, int seq, bool accepted, const String& text)
{
  String message;
  message.reserve(160);
  message += F("{\"type\":\"mission_upload_ack\",\"missionId\":\"");
  message += escapeJson(missionId);
  message += F("\",\"seq\":");
  message += seq;
  message += F(",\"accepted\":");
  message += (accepted ? F("true") : F("false"));
  message += F(",\"message\":\"");
  message += escapeJson(text);
  message += F("\"}");
  webSocket.sendTXT(clientNum, message);
}

void sendMissionProgress(uint8_t clientNum)
{
  if (uploadMissionId.length() == 0)
    return;

  String message;
  message.reserve(180);
  message += F("{\"type\":\"mission_upload_progress\",\"missionId\":\"");
  message += escapeJson(uploadMissionId);
  message += F("\",\"receivedWaypoints\":");
  message += uploadReceivedWaypoints;
  message += F(",\"waypointCount\":");
  message += uploadWaypointCount;
  if (uploadChecksum.length() > 0)
  {
    message += F(",\"checksum\":\"");
    message += escapeJson(uploadChecksum);
    message += F("\"");
  }
  message += '}';
  webSocket.sendTXT(clientNum, message);
}

bool hasSocketClient()
{
  return connectedClientCount > 0;
}

